Term4/algo/hws/3.9.org
#+LATEX_CLASS: general
#+TITLE: ДЗ
#+AUTHOR: Ilya Yaroshevskiy

#+begin_export latex
\usetikzlibrary{decorations.pathmorphing}
#+end_export


* Задание 3.9
:PROPERTIES:
:UNNUMBERED:
:END:
/Дан неориентированный граф. Найти максимальное число вершинно непересекающихся путей
из \(s\) в \(t\)/.
------
Сделаем из неориентированного графа ориентированный, построив для
каждого неор. ребра \((u, v)\), ор. ребра \((u, v)\) и \((v, u)\) с
пропускными способностями равными \(1\).

Теперь перестроим граф следующим образом: каждую вершину \(u\), кроме \(s\) и \(t\), заменим
на две \(u_1\) и \(u_2\). \(\forall v: (v, u) \in E\) добавим ребро
\((v, u_1)\), аналогично \(\forall w: (u, w) \in E\) добавим ребро
\((u_2, w)\). Добавим ребро \((u_1, u_2)\) с пропускной способностью
равной \(1\).

#+begin_export latex
\begin{center}
\begin{tikzpicture}
\node[draw=black] (A) at (0, 0) [circle] {\(u\)};
\draw[decorate,decoration=snake,->] (-1.5, 0) -- (A);
\draw[decorate,decoration=snake,->] (A) -- (1.5, 0);
\node at (0, -1) {\(\Downarrow\)};
\node[draw=black] (B) at (-1, -2) [circle] {\(u_1\)};
\node[draw=black] (C) at (1, -2) [circle] {\(u_2\)};
\draw[->] (B) -- node[above] {\(1\)} (C);
\draw[decorate,decoration=snake,->] (-2.4, -2) -- (B);
\draw[decorate,decoration=snake,->] (C) -- (2.4, -2);
\end{tikzpicture}
\end{center}
#+end_export

Рассмотрим вершинно непересекающиеся пути \(s \leadsto t\) в исходном графе. Заметим
что в новом графе соответсвующие пути также будут вершинно непересекающимися,
значит по каждому такому пути можно пустить поток величины
\(1\). Тогда будет выполняться неравенство \(k \le F_{\max}\), где \(k\) ---
число вершинно непересекающихся путей, \(F_{\max}\) --- максимальный поток в новом графе.

Рассмотрим максимальный поток, в котором поток по каждому ребру
целочисленный(задача 3.3).
1) \label{3_9_1}'Запустим' dfs из начальной вершины до конечной: будем
   ходить по ребрам, поток по которым равен \(1\).
2) \label{3_9_2}Заметим, что для всех
   ребер \((u_1, u_2)\) поток по ним не больше \(1\), значит суммарный
   входящий в \(u_1\) и выходящий из \(u_2\) потоки также не превышают \(1\).
   #+begin_export latex
   \begin{center}
   \begin{tikzpicture}
   \node[draw=black] (A) at (-1, 0) [circle] {\(u_1\)};
   \node[draw=black] (B) at (1, 0) [circle] {\(u_2\)};
   \draw[->] (-2.5, 1) -- node[above] {\(\color{red}1\color{black}/1\)} (A);
   \draw[->] (-2.5, 0) -- node[above] {\(\color{red}0\color{black}/1\)} (A);
   \draw[->] (-2.5, -1) -- node[above] {\(\color{red}0\color{black}/1\)} (A);
   \draw[->] (A) -- node[above] {\(\color{red}1\color{black}/1\)} (B);
   \draw[->] (B) -- node[above] {\(\color{red}1\color{black}/1\)} (2.5, 0);
   \draw[->] (B) -- node[above] {\(\color{red}0\color{black}/1\)} (2.5, 1);
   \draw[->] (B) -- node[above] {\(\color{red}0\color{black}/1\)} (2.5, -1);
   \end{tikzpicture}
   \end{center}
   #+end_export

С учетом п. \ref{3_9_2}, различные пути найденные в п. \ref{3_9_1} будут вершинно непересекающиеся и
их количество будет равно суммарному потоку: \(k \le k_{\max} \le F_{\max},\ k = F_{\max} \Rightarrow k_{\max} = F_{\max}\)

Осталось показать что найденные пути будут существовать в исходном
графе. Действительно, если путь проходит через вершину \(u_1\), то он
проходит и через вершину \(u_2\). Значит можно сжать эти две вершину в
одну, которая в свою очередь однозначно определяется в исходном графе.

Получаем что максимальное количество вершинно непересекающихся путей в
неориентированном графе равно максимальному потоку в графе,
построенному выше указаным образом.
